[
  {
    "nome": "React",
    "ano": 2013,
    "descricao": "React é uma biblioteca JavaScript declarativa para construir interfaces de usuário, especialmente para aplicações de página única. Ela permite que desenvolvedores criem componentes de UI reutilizáveis e gerenciem o estado de forma eficiente usando um Virtual DOM. Mantida pelo Meta e por uma comunidade de código aberto, é amplamente utilizada no desenvolvimento web e móvel.",
    "link": "https://react.dev/",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg"
  },
  {
    "nome": "Delphi",
    "ano": 1995,
    "descricao": "Delphi é um ambiente de desenvolvimento integrado (IDE) para desenvolvimento rápido de aplicações (RAD), que utiliza a linguagem Object Pascal. Permite a criação de aplicações nativas para desktop, mobile, web e IoT a partir de uma única base de código. É conhecido por seu compilador de alta performance e seu design visual baseado em componentes.",
    "link": "https://www.embarcadero.com/products/delphi",
    "logo": "https://d2ohlsp9gwqc7h.cloudfront.net/images/logos/EMBT_Primary_Logo_Black_2025_Idera.webp"
  },
  {
    "nome": "Vue.js",
    "ano": 2014,
    "descricao": "Vue.js é um framework JavaScript progressivo de código aberto para a construção de interfaces de usuário e aplicações de página única. Ele é projetado para ser adaptável e pode ser facilmente integrado a projetos existentes ou usado para desenvolver aplicações complexas. Sua arquitetura baseada em componentes e sistema de reatividade o tornam uma escolha popular para desenvolvimento front-end.",
    "link": "https://vuejs.org/",
    "logo": "https://vuejs.org/images/logo.png"
  },
  {
    "nome": "Angular",
    "ano": 2016,
    "descricao": "Angular é uma plataforma e um framework para construir aplicações web e móveis SPA (Single Page Application) usando HTML e TypeScript. Desenvolvido pelo Google, ele oferece uma abordagem estruturada com componentes, serviços e módulos, facilitando o desenvolvimento e a manutenção de aplicações complexas. É amplamente utilizado para criar interfaces de usuário dinâmicas e de alto desempenho.",
    "link": "https://angular.io/",
    "logo": "https://angular.io/assets/images/logos/angular/angular.png"
  },
  {
    "nome": "Inteligência Artificial",
    "ano": 1956,
    "descricao": "Inteligência Artificial (IA) é um campo da ciência da computação que se dedica à criação de máquinas capazes de raciocinar, aprender e agir de forma autônoma. Ela permite que sistemas imitem habilidades cognitivas humanas, como resolução de problemas e reconhecimento de padrões. O objetivo é desenvolver tecnologia que possa executar tarefas complexas de maneira inteligente.",
    "link": "https://www.aaai.org/",
    "logo": null
  },
  {
    "nome": "Apache Flex",
    "ano": 2004,
    "descricao": "Apache Flex é um framework de código aberto para construir e manter Rich Internet Applications (RIAs) baseadas na plataforma Adobe Flash ou Adobe AIR. Ele permite aos desenvolvedores criar aplicações web, desktop e mobile altamente interativas usando MXML e ActionScript 3. A tecnologia teve sua origem como Adobe Flex em 2004, tornando-se mais tarde um projeto Top-Level da Apache Software Foundation.",
    "link": "http://flex.apache.org/",
    "logo": "http://flex.apache.org/images/logo_small_apache_flex.png"
  },
  {
    "nome": "Python",
    "ano": 1991,
    "descricao": "Python é uma linguagem de programação de alto nível, interpretada, de propósito geral, conhecida por sua sintaxe clara e legibilidade de código. É amplamente utilizada em diversas áreas como desenvolvimento web, ciência de dados, inteligência artificial, automação e scripting. A linguagem suporta múltiplos paradigmas de programação, incluindo programação orientada a objetos, imperativa e funcional.",
    "link": "https://www.python.org/",
    "logo": "https://www.python.org/static/img/python-logo.png"
  },
  {
    "nome": "C++",
    "ano": 1979,
    "descricao": "C++ é uma linguagem de programação de propósito geral, poderosa e de alto desempenho, que estende a linguagem C. Ela suporta múltiplos paradigmas de programação, incluindo programação procedural, orientada a objetos e genérica. É amplamente utilizada em sistemas operacionais, desenvolvimento de jogos, sistemas embarcados e aplicações de alta performance.",
    "link": "https://isocpp.org/",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/C%2B%2B_Logo.svg/1200px-C%2B%2B_Logo.svg.png"
  },
  {
    "nome": "Go",
    "ano": 2009,
    "descricao": "Go é uma linguagem de programação de código aberto desenvolvida pelo Google, focada em simplicidade, confiabilidade e eficiência. Ela é fortemente tipada e compilada, projetada para construir software robusto e de alto desempenho. Sua sintaxe concisa e recursos de concorrência integrados, como goroutines, a tornam popular para microsserviços e sistemas distribuídos.",
    "link": "https://golang.org/",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/0/07/Go_logo.svg"
  },
  {
    "nome": "BASIC",
    "ano": 1964,
    "descricao": "BASIC (Beginner's All-purpose Symbolic Instruction Code) é uma família de linguagens de programação de alto nível projetada para ser fácil de usar. Criada em 1964, foi desenvolvida para permitir que estudantes de diversas áreas usassem computadores. Teve um papel crucial na popularização da programação em computadores pessoais nos anos 70 e 80.",
    "link": "https://en.wikipedia.org/wiki/BASIC",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/BASIC_logo.svg/1200px-BASIC_logo.svg.png"
  },
  {
    "nome": "Java",
    "ano": 1995,
    "descricao": "Java é uma linguagem de programação orientada a objetos de alto nível e uma plataforma de computação. Projetada para ser \"escreva uma vez, execute em qualquer lugar\" (WORA), seu código compilado pode rodar em todas as plataformas que suportam Java sem a necessidade de recompilação. É amplamente utilizada para desenvolver aplicações corporativas, mobile (Android), web e sistemas de larga escala.",
    "link": "https://www.oracle.com/java/",
    "logo": "https://upload.wikimedia.org/wikipedia/en/thumb/3/30/Java_logo_and_wordmark.svg/1200px-Java_logo_and_wordmark.svg.png"
  },
  {
    "nome": "JavaScript",
    "ano": 1995,
    "descricao": "JavaScript é uma linguagem de programação de alto nível, interpretada ou compilada just-in-time, multiparadigma. É mais conhecida como a linguagem de script para páginas web, tornando-as interativas e dinâmicas. No entanto, é amplamente utilizada em ambientes fora do navegador, como desenvolvimento de servidores (Node.js), aplicativos móveis e desktop.",
    "link": "https://developer.mozilla.org/en-US/docs/Web/JavaScript",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/6/6a/JavaScript-logo.png"
  },
  {
    "nome": "TypeScript",
    "ano": 2012,
    "descricao": "TypeScript é uma linguagem de programação de código aberto desenvolvida pela Microsoft. É um superconjunto sintático de JavaScript que adiciona tipagem estática opcional, compilando para JavaScript puro. Ele melhora a qualidade do código, a produtividade e a detecção de erros em tempo de desenvolvimento para aplicações JavaScript em larga escala.",
    "link": "https://www.typescriptlang.org/",
    "logo": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Typescript_logo_2020.svg"
  },
  {
    "nome": "PostgreSQL",
    "ano": 1996,
    "descricao": "PostgreSQL é um poderoso sistema de gerenciamento de banco de dados relacional de objeto (ORDBMS) de código aberto e gratuito. Ele é conhecido por sua robustez, conjunto de recursos avançados, escalabilidade e conformidade com padrões SQL. Amplamente utilizado em aplicações web, sistemas de data warehousing e como banco de dados principal para muitos produtos e soluções.",
    "link": "https://www.postgresql.org/",
    "logo": "https://www.postgresql.org/media/img/postgresql-logo.png"
  },
  {
    "nome": "Design Sprint (Google Ventures)",
    "ano": 2016,
    "descricao": "O Design Sprint é uma metodologia intensiva de cinco dias, desenvolvida pelo Google Ventures, para responder a questões críticas de negócios através de design, prototipagem e teste de ideias com usuários. Ele permite que equipes validem rapidamente conceitos e resolvam grandes problemas. O principal objetivo é reduzir o risco de desenvolver produtos que ninguém quer ou precisa.",
    "link": "https://www.gv.com/sprint/",
    "logo": "https://www.gv.com/sprint/wp-content/uploads/2016/03/sprint-book.png"
  },
  {
    "nome": "Node.js",
    "ano": 2009,
    "descricao": "Node.js é um ambiente de execução JavaScript open-source e cross-platform, que permite aos desenvolvedores executar código JavaScript no lado do servidor, fora de um navegador web. Ele é amplamente utilizado para construir aplicações de rede escaláveis, APIs RESTful e serviços de backend em tempo real. Sua arquitetura assíncrona e orientada a eventos o torna eficiente para lidar com muitas conexões simultâneas.",
    "link": "https://nodejs.org/",
    "logo": "https://nodejs.org/static/images/logo.svg"
  },
  {
    "nome": "Power BI",
    "ano": 2015,
    "descricao": "Power BI é uma ferramenta de business intelligence da Microsoft que permite aos usuários visualizar dados e criar relatórios interativos. Ele se conecta a diversas fontes de dados, transformando-os em informações significativas. Com o Power BI, é possível compartilhar insights e tomar decisões baseadas em dados de forma eficiente.",
    "link": "https://powerbi.microsoft.com/",
    "logo": "https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RWJ3d5?ver=0b7e"
  }
]